package ru.anasttruh.cproject.carParts.addPart


data class PartSpecs(
    val name: String,
    val system: String,
    val mileageRange: IntRange,
    val lifespanRange: IntRange
)

val partsSpecs = listOf(
    PartSpecs("Свечи зажигания", "Система зажигания", 30000..100000, 3..5),
    PartSpecs("Топливный фильтр", "Топливная система", 30000..60000, 2..3),
    PartSpecs("Воздушный фильтр", "Система впуска", 15000..30000, 1..2),
    PartSpecs("Масляный фильтр", "Система смазки", 10000..15000, 1..1),
    PartSpecs("Сальники коленвала", "Система смазки", 100000..200000, 5..8),
    PartSpecs("Ремень ГРМ", "Газораспределительный механизм", 60000..100000, 4..5),
    PartSpecs("Цепь ГРМ", "Газораспределительный механизм", 200000..300000, 10..15),
    PartSpecs("Поршневые кольца", "Двигатель", 200000..400000, 8..12),
    PartSpecs("Подшипники коленвала", "Двигатель", 200000..300000, 8..10),
    PartSpecs("Термостат", "Система охлаждения", 100000..150000, 5..7),
    PartSpecs("Водяной насос", "Система охлаждения", 100000..200000, 6..10),
    PartSpecs("Радиатор", "Система охлаждения", 150000..300000, 8..15),
    PartSpecs("Амортизаторы", "Ходовая часть", 80000..150000, 5..8),
    PartSpecs("Пружины подвески", "Ходовая часть", 150000..300000, 8..12),
    PartSpecs("Рулевые наконечники", "Рулевое управление", 80000..120000, 4..6),
    PartSpecs("Рулевая рейка", "Рулевое управление", 150000..250000, 8..12),
    PartSpecs("Тормозные колодки", "Тормозная система", 30000..70000, 2..4),
    PartSpecs("Тормозные диски", "Тормозная система", 80000..150000, 4..6),
    PartSpecs("Тормозной суппорт", "Тормозная система", 150000..200000, 8..10),
    PartSpecs("Аккумулятор", "Электрооборудование", 50000..100000, 3..5),
    PartSpecs("Генератор", "Электрооборудование", 150000..250000, 8..12),
    PartSpecs("Стартер", "Электрооборудование", 100000..200000, 6..10),
    PartSpecs("Сцепление", "Трансмиссия", 100000..200000, 5..8),
    PartSpecs("Масло в двигателе", "Система смазки", 10000..15000, 1..1),
    PartSpecs("Коробка передач (механика)", "Трансмиссия", 200000..300000, 10..15),
    PartSpecs("Коробка передач (автомат)", "Трансмиссия", 150000..250000, 8..12),
    PartSpecs("Приводной вал", "Трансмиссия", 150000..250000, 8..12),
    PartSpecs("Шины", "Ходовая часть", 40000..80000, 3..5)
)